import styles from "../styles/_Terms.module.scss";
import StyledContainer from "../components/UI/StyledContainer";
import StyledHeader from "../components/UI/StyledHeader";
import TermsItem from "../components/Terms and Conditions/TermsItem";
import AnimatedContainer from "../components/UI/AnimatedContainer";

const DUMMY_DATA = [
  {
    id: "0",
    head: "تعريفات",
    subMenu: [
      {
        id: "0",
        name: "لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور",
      },
      {
        id: "1",
        name: "لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور",
      },
    ],
  },
  {
    id: "1",
    head: "من نحن وكيف يمكنك التواصل معنا",
    subMenu: [
      {
        id: "1",
        name: "لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور",
      },
      {
        id: "2",
        name: "لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور",
      },
      {
        id: "3",
        name: "لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور",
      },
      {
        id: "4",
        name: "لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور",
      },
    ],
  },
  {
    id: "2",
    head: "الخدمات",
    subMenu: [
      {
        id: "1",
        name: "لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور",
      },
      {
        id: "2",
        name: "لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور",
      },
      {
        id: "3",
        name: "لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور",
      },
    ],
  },
  {
    id: "3",
    head: "الحماية",
    subMenu: [
      {
        id: "1",
        name: "لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور",
      },
    ],
  },
];
const Terms = () => {
  return (
    <AnimatedContainer className={styles.terms}>
      <StyledContainer>
        <StyledHeader>الشروط والأحكام</StyledHeader>
        <div className={styles.items}>
          <p className={styles.paragraph}>
            لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو
            أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا . يوت
            انيم أد مينيم فينايم,كيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي
            يت أليكيوب أكس أيا كوممودو كونسيكيوات . ديواس أيوتي أريري دولار إن
            ريبريهينديرأيت فوليوبتاتي فيلايت أيسسي كايلليوم دولار أيو فيجايت
            نيولا باراياتيور. أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون
            بروايدينت ,سيونت ان كيولبا كيو أوفيسيا ديسيريونتموليت انيم أيدي ايست
            لابوريوم.
          </p>
          <div>
            {DUMMY_DATA.map((item, index) => {
              return <TermsItem key={item.id} index={index} item={item} />;
            })}
          </div>
        </div>
      </StyledContainer>
    </AnimatedContainer>
  );
};

export default Terms;
